<?php

declare(strict_types=1);

return [
    // Australia
    'AU' => 'استرالیا',
    'AU-ACT' => 'استرالیا - قلمرو پایتخت استرالیا',
    'AU-NSW' => 'استرالیا - نیو ساوت ولز',
    'AU-NT' => 'استرالیا - قلمرو شمالی',
    'AU-QLD' => 'استرالیا - کوئینزلند',
    'AU-SA' => 'استرالیا - استرالیای جنوبی',
    'AU-TAS' => 'استرالیا - تاسمانی',
    'AU-VIC' => 'استرالیا - ویکتوریا',
    'AU-WA' => 'استرالیا - استرالیای غربی',

    // Austria
    'AT' => 'اتریش',
    'AT-1' => 'اتریش - بورگن‌لاند',
    'AT-2' => 'اتریش - کرنتن',
    'AT-3' => 'اتریش - اتریش سفلی',
    'AT-4' => 'اتریش - اتریش علیا',
    'AT-5' => 'اتریش - زالتسبورگ',
    'AT-6' => 'اتریش - اشتایرمارک',
    'AT-7' => 'اتریش - تیرول',
    'AT-8' => 'اتریش - فورآرلبرگ',
    'AT-9' => 'اتریش - وین',

    // Belarus
    'BY' => 'بلاروس',

    // Belgium
    'BE' => 'بلژیک',

    // Brazil
    'BR' => 'برزیل',

    // Bulgaria
    'BG' => 'بلغارستان',

    // Canada
    'CA' => 'کانادا',
    'CA-AB' => 'کانادا - آلبرتا',
    'CA-BC' => 'کانادا - بریتیش کلمبیا',
    'CA-MB' => 'کانادا - مانیتوبا',
    'CA-NB' => 'کانادا - نیوبرانزویک',
    'CA-NL' => 'کانادا - نیوفاندلند و لابرادور',
    'CA-NT' => 'کانادا - قلمروهای شمال غرب',
    'CA-NS' => 'کانادا - نوا اسکوشیا',
    'CA-NU' => 'کانادا - نوناووت',
    'CA-ON' => 'کانادا - انتاریو',
    'CA-PE' => 'کانادا - جزیره پرنس ادوارد',
    'CA-QC' => 'کانادا - کبک',
    'CA-SK' => 'کانادا - ساسکاچوان',
    'CA-YT' => 'کانادا - یوکان',

    // Czech Republic
    'CZ' => 'جمهوری چک',

    // Denmark
    'DK' => 'دانمارک',

    // Estonia
    'EE' => 'استونی',

    // Finland
    'FI' => 'فنلاند',

    // France
    'FR' => 'فرانسه',
    'FR-57' => 'فرانسه - موزل',
    'FR-67' => 'فرانسه - رن سفلی',
    'FR-68' => 'فرانسه - رن علیا',
    'FR-GF' => 'فرانسه - گویان فرانسه',
    'FR-GUA' => 'فرانسه - گوادلوپ',
    'FR-LRE' => 'فرانسه - رئونیون',
    'FR-MQ' => 'فرانسه - مارتینیک',

    // Germany
    'DE' => 'آلمان',
    'DE-BB' => 'آلمان - براندنبورگ',
    'DE-BE' => 'آلمان - برلین',
    'DE-BW' => 'آلمان - بادن-وورتمبرگ',
    'DE-BY' => 'آلمان - باواریا',
    'DE-HB' => 'آلمان - برمن',
    'DE-HE' => 'آلمان - هسن',
    'DE-HH' => 'آلمان - هامبورگ',
    'DE-MV' => 'آلمان - مکلنبورگ-فورپومرن',
    'DE-NI' => 'آلمان - نیدرزاکسن',
    'DE-NW' => 'آلمان - نوردراین-وستفالن',
    'DE-RP' => 'آلمان - راینلاند-فالتس',
    'DE-SH' => 'آلمان - شلسویگ-هولشتاین',
    'DE-SL' => 'آلمان - زارلند',
    'DE-SN' => 'آلمان - زاکسن',
    'DE-ST' => 'آلمان - زاکسن-آنهالت',
    'DE-TH' => 'آلمان - تورینگن',

    // Greenland
    'GL' => 'گرینلند',

    // Iceland
    'IS' => 'ایسلند',

    // Ireland
    'IE' => 'ایرلند',

    // Italy
    'IT' => 'ایتالیا',
    'IT-32' => 'ایتالیا - تیرول جنوبی',

    // Latvia
    'LV' => 'لتونی',

    // Liechtenstein
    'FL' => 'لیختن‌اشتاین',

    // Lithuania
    'LT' => 'لیتوانی',

    // Luxembourg
    'LU' => 'لوکزامبورگ',

    // Mexico
    'MX' => 'مکزیک',

    // Netherlands
    'NL' => 'هلند',

    // Norway
    'NO' => 'نروژ',

    // Poland
    'PL' => 'لهستان',

    // Portugal
    'PT' => 'پرتغال',
    'PT-20' => 'پرتغال - آزور',
    'PT-30' => 'پرتغال - مادیرا',

    // Russia
    'RU' => 'روسیه',

    // Spain
    'ES' => 'اسپانیا',

    // Sweden
    'SE' => 'سوئد',

    // Switzerland
    'CH' => 'سوئیس',
    'CH-AG' => 'سوئیس - آرگاو',
    'CH-AI' => 'سوئیس - آپنتسل اینررودن',
    'CH-AR' => 'سوئیس - آپنتسل آوسررودن',
    'CH-BE' => 'سوئیس - برن',
    'CH-BL' => 'سوئیس - بازل-لاندشافت',
    'CH-BS' => 'سوئیس - بازل-اشتات',
    'CH-FR' => 'سوئیس - فریبورگ',
    'CH-GE' => 'سوئیس - ژنو',
    'CH-GL' => 'سوئیس - گلاروس',
    'CH-GR' => 'سوئیس - گراوبوندن',
    'CH-JU' => 'سوئیس - ژورا',
    'CH-LU' => 'سوئیس - لوتسرن',
    'CH-NE' => 'سوئیس - نوشاتل',
    'CH-NW' => 'سوئیس - نیدوالدن',
    'CH-OW' => 'سوئیس - اوبوالدن',
    'CH-SG' => 'سوئیس - سنت گالن',
    'CH-SH' => 'سوئیس - شاف‌هاوزن',
    'CH-SO' => 'سوئیس - زولوترن',
    'CH-SZ' => 'سوئیس - شویتس',
    'CH-TG' => 'سوئیس - تورگاو',
    'CH-TI' => 'سوئیس - تیچینو',
    'CH-UR' => 'سوئیس - اوری',
    'CH-VD' => 'سوئیس - وو',
    'CH-VS' => 'سوئیس - وله',
    'CH-ZG' => 'سوئیس - زوگ',
    'CH-ZH' => 'سوئیس - زوریخ',

    // Turkey
    'TR' => 'ترکیه',

    // Ukraine
    'UA' => 'اوکراین',

    // United Kingdom
    'GB' => 'بریتانیا',
    'GB-NIR' => 'بریتانیا - ایرلند شمالی',
    'GB-SCT' => 'بریتانیا - اسکاتلند',

    // USA
    'US' => 'ایالات متحده',
];
